* BASIC PROGRAM SECTIONS AND LABELS
HELLO    CSECT
BEGIN    STM   14,12,12(13)
SAVE     ST    13,SAVEAREA+4
DONE     LM    14,12,12(13)
         END   HELLO
