* THIS PROGRAM DEMONSTRATES COMMENT LINES
* A COMMENT STARTS WITH AN ASTERISK IN COLUMN 1
*
* BLANK COMMENT ABOVE IS ALSO FINE
SAMPLE   CSECT
* COMMENTS MAY APPEAR BETWEEN INSTRUCTIONS
         BR    14
* TRAILING COMMENT AT END OF FILE
