* CONTINUATION LINE IN OPERANDS
LONGOP   CSECT  ABCDEFGHIJKLOMNOPQRSTUVWXYZABCDEFGHIJKLOMNOPQRSTUVWXYZABCDEFGH
                0123456789
* CONTINUATION LINE IN REMARK
LONGRMK  CSECT  14,12,12(13)  REMARKABCDEFGHIJKLMNOPQRSTUVWXYZABCDEFGHIJKLMNO
                PQRSTUVWY
* DOUBLE CONTINUATION
LONGDBL  CSECT  ABCDEFGHIJKLOMNOPQRSTUVWXYZABCDEFGHIJKLOMNOPQRSTUVWXYZABCDEFGH
                ABCDEFGHIJKLOMNOPQRSTUVWXYZABCDEFGHIJKLOMNOPQRSTUVWXYZABCDEFGH
                0123456789
