**FREE
// Simple free-form program with the **FREE marker
dcl-s greeting varchar(50) inz('Hello, world');
dcl-s counter int(10) inz(0);
counter += 1;
dsply greeting;
*inlr = *on;
